IainmoselyEM/30kwsystemmainboard/SourceLoadSystem.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F28P65x" --package "256ZEJ" --part "F28P65x_256ZEJ" --context "CPU1" --product "C2000WARE@5.02.00.00"
 * @versions {"tool":"1.18.0+3266"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc            = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1           = adc.addInstance();
const adc2           = adc.addInstance();
const adc3           = adc.addInstance();
const analog         = scripting.addModule("/driverlib/analog.js", {}, false);
const analog1        = analog.addInstance();
const can            = scripting.addModule("/driverlib/can.js", {}, false);
const can1           = can.addInstance();
const cmpss          = scripting.addModule("/driverlib/cmpss.js", {}, false);
const cmpss1         = cmpss.addInstance();
const cmpss2         = cmpss.addInstance();
const cmpss3         = cmpss.addInstance();
const cmpss4         = cmpss.addInstance();
const cmpss5         = cmpss.addInstance();
const cmpss6         = cmpss.addInstance();
const cmpss7         = cmpss.addInstance();
const cmpss8         = cmpss.addInstance();
const cmpss9         = cmpss.addInstance();
const cmpss10        = cmpss.addInstance();
const cmpss11        = cmpss.addInstance();
const cputimer       = scripting.addModule("/driverlib/cputimer.js", {}, false);
const cputimer1      = cputimer.addInstance();
const cputimer2      = cputimer.addInstance();
const device_support = scripting.addModule("/driverlib/device_support.js");
const dma            = scripting.addModule("/driverlib/dma.js", {}, false);
const dma1           = dma.addInstance();
const epwm           = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1          = epwm.addInstance();
const epwm2          = epwm.addInstance();
const eqep           = scripting.addModule("/driverlib/eqep.js", {}, false);
const eqep1          = eqep.addInstance();
const eqep2          = eqep.addInstance();
const gpio           = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1          = gpio.addInstance();
const gpio2          = gpio.addInstance();
const gpio3          = gpio.addInstance();
const gpio4          = gpio.addInstance();
const gpio5          = gpio.addInstance();
const gpio6          = gpio.addInstance();
const gpio7          = gpio.addInstance();
const gpio8          = gpio.addInstance();
const gpio9          = gpio.addInstance();
const gpio10         = gpio.addInstance();
const gpio11         = gpio.addInstance();
const gpio12         = gpio.addInstance();
const memcfg         = scripting.addModule("/driverlib/memcfg.js");
const outputxbar     = scripting.addModule("/driverlib/outputxbar.js", {}, false);
const outputxbar1    = outputxbar.addInstance();
const spi            = scripting.addModule("/driverlib/spi.js", {}, false);
const spi1           = spi.addInstance();
const sysctl         = scripting.addModule("/driverlib/sysctl.js");
const uart           = scripting.addModule("/driverlib/uart.js", {}, false);
const uart1          = uart.addInstance();
const usb            = scripting.addModule("/driverlib/usb.js", {}, false);
const usb1           = usb.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.adcClockPrescaler       = "ADC_CLK_DIV_4_0";
adc1.adcResolutionMode       = "ADC_RESOLUTION_16BIT";
adc1.soc0SampleWindow        = 100;
adc1.soc1SampleWindow        = 100;
adc1.enabledInts             = ["ADC_INT_NUMBER1"];
adc1.enableInterrupt1        = true;
adc1.soc2SampleWindow        = 100;
adc1.soc3SampleWindow        = 100;
adc1.soc4SampleWindow        = 100;
adc1.soc5SampleWindow        = 100;
adc1.soc6SampleWindow        = 100;
adc1.soc7SampleWindow        = 100;
adc1.soc8Channel             = "ADC_CH_ADCIN8";
adc1.soc8SampleWindow        = 100;
adc1.soc9Channel             = "ADC_CH_ADCIN9";
adc1.soc9SampleWindow        = 100;
adc1.soc10Channel            = "ADC_CH_ADCIN10";
adc1.soc10SampleWindow       = 100;
adc1.soc11Channel            = "ADC_CH_ADCIN11";
adc1.soc11SampleWindow       = 100;
adc1.soc11Trigger            = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc10Trigger            = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc9Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc8Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc1.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc1.registerInterrupts      = ["1"];
adc1.soc6Channel             = "ADC_CH_ADCIN6";
adc1.soc1Channel             = "ADC_CH_ADCIN1";
adc1.soc2Channel             = "ADC_CH_ADCIN2";
adc1.soc3Channel             = "ADC_CH_ADCIN3";
adc1.soc4Channel             = "ADC_CH_ADCIN4";
adc1.soc5Channel             = "ADC_CH_ADCIN5";
adc1.$name                   = "myADCA";
adc1.soc7Channel             = "ADC_CH_ADCIN7";
adc1.soc0Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc1Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc2Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc3Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc4Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc5Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc6Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc7Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc1.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER10","ADC_SOC_NUMBER11","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5","ADC_SOC_NUMBER6","ADC_SOC_NUMBER7","ADC_SOC_NUMBER8","ADC_SOC_NUMBER9"];
adc1.interrupt1SOCSource     = "ADC_INT_TRIGGER_EOC11";
adc1.adcInt1.enableInterrupt = true;

adc2.$name             = "myADCB";
adc2.adcBase           = "ADCB_BASE";
adc2.adcClockPrescaler = "ADC_CLK_DIV_4_0";
adc2.adcResolutionMode = "ADC_RESOLUTION_16BIT";
adc2.enabledSOCs       = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5"];
adc2.soc0SampleWindow  = 100;
adc2.soc1Channel       = "ADC_CH_ADCIN1";
adc2.soc1SampleWindow  = 100;
adc2.soc2Channel       = "ADC_CH_ADCIN2";
adc2.soc2SampleWindow  = 100;
adc2.soc3Channel       = "ADC_CH_ADCIN3";
adc2.soc3SampleWindow  = 100;
adc2.soc4Channel       = "ADC_CH_ADCIN4";
adc2.soc4SampleWindow  = 100;
adc2.soc5Channel       = "ADC_CH_ADCIN5";
adc2.soc5SampleWindow  = 100;
adc2.soc0Trigger       = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc1Trigger       = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc2Trigger       = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc3Trigger       = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc4Trigger       = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc5Trigger       = "ADC_TRIGGER_EPWM1_SOCA";

adc3.$name             = "myADCC";
adc3.adcBase           = "ADCC_BASE";
adc3.adcClockPrescaler = "ADC_CLK_DIV_4_0";
adc3.adcResolutionMode = "ADC_RESOLUTION_16BIT";
adc3.enabledSOCs       = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc3.soc0Trigger       = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc0SampleWindow  = 100;
adc3.soc1Trigger       = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc1SampleWindow  = 100;

