IainmoselyEM/30kwsystemmainboard/SourceLoadSystem.syscfg
can1.$name                   = "SLS_CANA";
can1.enableAutoBusOn         = true;
can1.registerInterrupts      = true;
can1.interruptFlags          = ["CAN_INT_IE0"];
can1.interruptLine           = ["CAN_GLOBAL_INT_CANINT0"];
can1.enableInterrupt         = true;
can1.can.$assign             = "CANA";
can1.can.can_rxPin.$assign   = "GPIO5";
can1.can.can_txPin.$assign   = "GPIO4";
can1.can0Int.enableInterrupt = true;

const divider3       = system.clockTree["AUX_REFDIV"];
divider3.divideValue = 1;

const divider8       = system.clockTree["EPWMCLKDIV"];
divider8.divideValue = 1;

const divider13       = system.clockTree["PLL_REFDIV"];
divider13.divideValue = 1;

const multiplier2         = system.clockTree["PLL_IMULT"];
multiplier2.multiplyValue = 40;

const pinFunction2     = system.clockTree["X1"];
pinFunction2.XTAL_Freq = 10;

cmpss1.$name = "myCMPSS0";

cmpss2.$name     = "myCMPSS1";
cmpss2.cmpssBase = "CMPSS2_BASE";

cmpss3.$name     = "myCMPSS2";
cmpss3.cmpssBase = "CMPSS3_BASE";

cmpss4.$name     = "myCMPSS3";
cmpss4.cmpssBase = "CMPSS4_BASE";

cmpss5.$name     = "myCMPSS4";
cmpss5.cmpssBase = "CMPSS5_BASE";

cmpss6.$name     = "myCMPSS5";
cmpss6.cmpssBase = "CMPSS6_BASE";

cmpss7.$name     = "myCMPSS6";
cmpss7.cmpssBase = "CMPSS7_BASE";

cmpss8.$name     = "myCMPSS7";
cmpss8.cmpssBase = "CMPSS8_BASE";

cmpss9.$name     = "myCMPSS8";
cmpss9.cmpssBase = "CMPSS9_BASE";

cmpss10.$name     = "myCMPSS9";
cmpss10.cmpssBase = "CMPSS10_BASE";

cmpss11.$name     = "myCMPSS10";
cmpss11.cmpssBase = "CMPSS11_BASE";

analog1.$name                             = "myANALOGPinMux0";
adc1.analog                               = analog1;
cmpss1.analog                             = analog1;
cmpss2.analog                             = analog1;
cmpss3.analog                             = analog1;
cmpss4.analog                             = analog1;
cmpss5.analog                             = analog1;
cmpss6.analog                             = analog1;
cmpss7.analog                             = analog1;
cmpss8.analog                             = analog1;
cmpss9.analog                             = analog1;
cmpss10.analog                            = analog1;
cmpss11.analog                            = analog1;
adc2.analog                               = analog1;
adc3.analog                               = analog1;
analog1.analog.$assign                    = "ANALOG";
analog1.analog["a0/daca_outPin"].$assign  = "A0/DACA_OUT";
analog1.analog.a1Pin.$assign              = "A1";
analog1.analog["a11, gpio214Pin"].$assign = "A11, GPIO214";
analog1.analog.a2Pin.$assign              = "A2";
analog1.analog.a3Pin.$assign              = "A3";
analog1.analog.a4Pin.$assign              = "A4";
analog1.analog.a5Pin.$assign              = "A5";
analog1.analog["a6, gpio209Pin"].$assign  = "A6, GPIO209";

cputimer1.enableInterrupt          = true;
cputimer1.registerInterrupts       = true;
cputimer1.startTimer               = true;
cputimer1.timerPrescaler           = 200;
cputimer1.$name                    = "Heartbeat2Hz";
cputimer1.cputimerBase             = "CPUTIMER1_BASE";
cputimer1.timerPeriod              = 250000;
cputimer1.timerInt.enableInterrupt = true;

cputimer2.$name                    = "myCPUTIMER0";
cputimer2.timerPrescaler           = 200;
cputimer2.timerPeriod              = 1000;
cputimer2.enableInterrupt          = true;
cputimer2.registerInterrupts       = true;
cputimer2.startTimer               = true;
cputimer2.timerInt.enableInterrupt = true;

dma1.enableTriggers         = true;
dma1.triggerSource          = "DMA_TRIGGER_UARTATX";
dma1.useInterrupts          = true;
dma1.registerInterrupts     = true;
dma1.enableInterrupts       = true;
dma1.interruptMode          = "DMA_INT_AT_END";
dma1.srcAddressInputMode    = "VARIABLE";
dma1.srcAddressVariable     = "txAddr";
dma1.srcBurstStep           = 1;
dma1.srcTransferStep        = 1;
dma1.destAddressVariable    = "drAddr";
dma1.$name                  = "UARTATX_DMA";
dma1.dmaBase                = "DMA_CH5_BASE";
dma1.destAddressInputMode   = "VARIABLE";
dma1.burstSize              = 2;
dma1.transferSize           = 512;
dma1.dmaInt.enableInterrupt = true;

epwm1.epwmTimebase_emulationMode                               = "EPWM_EMULATION_FREE_RUN";
epwm1.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm1.epwmCounterCompare_cmpAGld                               = true;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_gld                 = true;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_gld                 = true;
epwm1.epwmDeadband_delayRED                                    = 20;
epwm1.epwmDeadband_delayFED                                    = 20;
epwm1.copyFrom                                                 = "CONV1SIDEB";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmDeadband_polarityFED                                 = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm1.$name                                                    = "SIDEA";
epwm1.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm1.epwmCounterCompare_enableShadowLoadModeCMPB              = false;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEnable                = true;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerSource                = "EPWM_SOC_TBCTR_ZERO";
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar        = "1";
epwm1.epwmTimebase_period                                      = 4000;
epwm1.epwmCounterCompare_cmpA                                  = 2000;
epwm1.epwm.$assign                                             = "EPWM1";
epwm1.epwm.epwm_aPin.$assign                                   = "GPIO145";
epwm1.epwm.epwm_bPin.$assign                                   = "GPIO146";

epwm2.$name                                                    = "SIDEB";
epwm2.copyFrom                                                 = "SIDEA";
epwm2.epwmTimebase_emulationMode                               = "EPWM_EMULATION_FREE_RUN";
epwm2.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm2.epwmTimebase_period                                      = 4000;
epwm2.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm2.epwmCounterCompare_cmpA                                  = 2000;
epwm2.epwmCounterCompare_cmpAGld                               = true;
epwm2.epwmCounterCompare_enableShadowLoadModeCMPB              = false;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_gld                 = true;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_gld                 = true;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmDeadband_polarityFED                                 = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm2.epwmDeadband_delayRED                                    = 20;
epwm2.epwmDeadband_delayFED                                    = 20;
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerEnable                = true;
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerSource                = "EPWM_SOC_TBCTR_ZERO";
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar        = "1";

eqep1.$name                       = "ENC2";
eqep1.enableModule                = true;
eqep1.positionCounterMode         = "EQEP_POSITION_RESET_MAX_POS";
eqep1.positionCounterMax          = 2000;
eqep1.swPositionInit              = true;
eqep1.eqepOperationMode           = "EQEP_CONFIG_CLOCK_DIR";
eqep1.eqepResolution              = "EQEP_CONFIG_1X_RESOLUTION";
eqep1.useInterrupts               = false;
eqep1.eqep.$assign                = "EQEP3";
eqep1.eqep.eqep_aPin.$assign      = "GPIO104";
eqep1.eqep.eqep_bPin.$assign      = "GPIO105";
eqep1.eqep.eqep_strobePin.$assign = "GPIO106";
eqep1.eqep.eqep_indexPin.$assign  = "GPIO107";

