IainmoselyEM/30kwsystemmainboard/SourceLoadSystem.syscfg
eqep2.$name                       = "ENC1";
eqep2.positionCounterMode         = "EQEP_POSITION_RESET_MAX_POS";
eqep2.positionCounterMax          = 2000;
eqep2.enableModule                = true;
eqep2.swPositionInit              = true;
eqep2.eqepOperationMode           = "EQEP_CONFIG_CLOCK_DIR";
eqep2.eqepResolution              = "EQEP_CONFIG_1X_RESOLUTION";
eqep2.registerInterrupts          = true;
eqep2.enableInterrupt             = true;
eqep2.useInterrupts               = false;
eqep2.eqep.$assign                = "EQEP5";
eqep2.eqep.eqep_aPin.$assign      = "GPIO108";
eqep2.eqep.eqep_bPin.$assign      = "GPIO109";
eqep2.eqep.eqep_strobePin.$assign = "GPIO110";
eqep2.eqep.eqep_indexPin.$assign  = "GPIO111";

gpio1.direction       = "GPIO_DIR_MODE_OUT";
gpio1.$name           = "Heartbeat";
gpio1.gpioPin.$assign = "GPIO9";

gpio2.$name           = "LED2";
gpio2.direction       = "GPIO_DIR_MODE_OUT";
gpio2.gpioPin.$assign = "GPIO8";

gpio3.$name           = "LED3";
gpio3.direction       = "GPIO_DIR_MODE_OUT";
gpio3.gpioPin.$assign = "GPIO99";

gpio4.$name           = "LED4";
gpio4.direction       = "GPIO_DIR_MODE_OUT";
gpio4.gpioPin.$assign = "GPIO22";

gpio5.$name           = "LED5";
gpio5.direction       = "GPIO_DIR_MODE_OUT";
gpio5.gpioPin.$assign = "GPIO95";

gpio6.$name           = "LED6";
gpio6.direction       = "GPIO_DIR_MODE_OUT";
gpio6.gpioPin.$assign = "GPIO92";

gpio7.$name             = "RAIL24ENABLE";
gpio7.direction         = "GPIO_DIR_MODE_OUT";
gpio7.writeInitialValue = true;
gpio7.gpioPin.$assign   = "GPIO14";

gpio8.$name             = "nBufferEnable";
gpio8.writeInitialValue = true;
gpio8.direction         = "GPIO_DIR_MODE_OUT";
gpio8.gpioPin.$assign   = "GPIO149";

gpio9.$name           = "myGPIO0";
gpio9.gpioPin.$assign = "GPIO122";

gpio10.$name           = "myGPIO1";
gpio10.gpioPin.$assign = "GPIO123";

gpio11.$name           = "myGPIO2";
gpio11.gpioPin.$assign = "GPIO124";

gpio12.$name           = "myGPIO3";
gpio12.gpioPin.$assign = "GPIO125";

outputxbar1.$name           = "myOUTPUTXBAR0";
outputxbar1.useSourceSelect = true;

spi1.mode                    = "SPI_MODE_CONTROLLER";
spi1.$name                   = "FM25V02A";
spi1.transferProtocol        = "SPI_PROT_POL0PHA1";
spi1.emulationMode           = "SPI_EMULATION_FREE_RUN";
spi1.bitRate                 = 5000000;
spi1.dataWidth               = "8";
spi1.useInterrupts           = false;
spi1.spi.spi_picoPin.$assign = "GPIO60";
spi1.spi.spi_pociPin.$assign = "GPIO61";
spi1.spi.spi_clkPin.$assign  = "GPIO58";
spi1.spi.spi_ptePin.$assign  = "GPIO59";

uart1.$name                   = "DCB_UART";
uart1.fen                     = true;
uart1.txiflsel                = "EOT";
uart1.rxiflsel                = "UART_FIFO_RX1_8";
uart1.registerInterrupts      = true;
uart1.enInterrupt             = false;
uart1.baud                    = 921600;
uart1.uart.$assign            = "UARTA";
uart1.uart.uart_txPin.$assign = "GPIO2";
uart1.uart.uart_rxPin.$assign = "GPIO3";
uart1.txQual.padConfig        = scripting.forceWrite("STD");

usb1.$name                = "myUSB0";
usb1.usb.$assign          = "USB0";
usb1.usb.usbdmPin.$assign = "GPIO42";
usb1.usb.usbdpPin.$assign = "GPIO43";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
analog1.analog["a10, gpio213Pin"].$suggestSolution    = "A10, GPIO213";
analog1.analog["a14/b14/c14Pin"].$suggestSolution     = "A14/B14/C14";
analog1.analog["a15/b15/c15Pin"].$suggestSolution     = "A15/B15/C15";
analog1.analog["a7, gpio210Pin"].$suggestSolution     = "A7, GPIO210";
analog1.analog["a8, gpio211Pin"].$suggestSolution     = "A8, GPIO211";
analog1.analog["a9, gpio212Pin"].$suggestSolution     = "A9, GPIO212";
analog1.analog["b0/vdacPin"].$suggestSolution         = "B0/VDAC";
analog1.analog["b1/dacc_outPin"].$suggestSolution     = "B1/DACC_OUT";
analog1.analog["b10, gpio219Pin"].$suggestSolution    = "B10, GPIO219";
analog1.analog.b11Pin.$suggestSolution                = "B11";
analog1.analog.b13Pin.$suggestSolution                = "B13";
analog1.analog.b2Pin.$suggestSolution                 = "B2";
analog1.analog.b3Pin.$suggestSolution                 = "B3";
analog1.analog["b4, gpio215Pin"].$suggestSolution     = "B4, GPIO215";
analog1.analog["b5, gpio216Pin"].$suggestSolution     = "B5, GPIO216";
analog1.analog["b6, gpio207Pin"].$suggestSolution     = "B6, GPIO207";
analog1.analog["b7, gpio208Pin"].$suggestSolution     = "B7, GPIO208";
analog1.analog["b8, gpio217Pin"].$suggestSolution     = "B8, GPIO217";
analog1.analog["b9, gpio218Pin"].$suggestSolution     = "B9, GPIO218";
analog1.analog["c0, gpio199Pin"].$suggestSolution     = "C0, GPIO199";
analog1.analog.c10Pin.$suggestSolution                = "C10";
analog1.analog.c11Pin.$suggestSolution                = "C11";
analog1.analog.c13Pin.$suggestSolution                = "C13";
analog1.analog.c2Pin.$suggestSolution                 = "C2";
analog1.analog["c3, gpio206Pin"].$suggestSolution     = "C3, GPIO206";
analog1.analog["c4, gpio205Pin"].$suggestSolution     = "C4, GPIO205";
analog1.analog["c5, gpio204Pin"].$suggestSolution     = "C5, GPIO204";
analog1.analog["c6, gpio203Pin"].$suggestSolution     = "C6, GPIO203";
analog1.analog["c1, gpio200Pin"].$suggestSolution     = "C1, GPIO200";
analog1.analog["c7, gpio198Pin"].$suggestSolution     = "C7, GPIO198";
analog1.analog["c8, gpio202Pin"].$suggestSolution     = "C8, GPIO202";
analog1.analog["c9, gpio201Pin"].$suggestSolution     = "C9, GPIO201";
epwm2.epwm.$suggestSolution                           = "EPWM2";
epwm2.epwm.epwm_aPin.$suggestSolution                 = "GPIO147";
epwm2.epwm.epwm_bPin.$suggestSolution                 = "GPIO148";
outputxbar1.outputxbar.$suggestSolution               = "OUTPUTXBAR1";
outputxbar1.outputxbar.outputxbarPin.$suggestSolution = "GPIO224/ERRORSTS";
spi1.spi.$suggestSolution                             = "SPIB";
